; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	spectrograph2 - mode
	infrared6 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	image5 - mode
	spectrograph3 - mode
	infrared4 - mode
	Star6 - direction
	GroundStation3 - direction
	Star2 - direction
	Star4 - direction
	Star7 - direction
	Star5 - direction
	GroundStation1 - direction
	Star0 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 infrared6)
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared6)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 infrared6)
	(supports instrument3 spectrograph3)
	(supports instrument3 infrared4)
	(calibration_target instrument3 Star7)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared4)
	(calibration_target instrument4 Star7)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
	(supports instrument5 image5)
	(calibration_target instrument5 Star5)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 Star0)
	(supports instrument7 spectrograph1)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
)
(:goal (and
	(pointing satellite2 Star11)
	(have_image Planet8 image5)
	(have_image Planet8 infrared6)
	(have_image Phenomenon9 infrared6)
	(have_image Phenomenon10 spectrograph2)
	(have_image Phenomenon10 spectrograph3)
	(have_image Star11 infrared6)
	(have_image Phenomenon12 image5)
	(have_image Star13 spectrograph1)
	(have_image Star13 image5)
))

)

; plan
1. (turn_to satellite2 star5 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star5)
   goals met: 0 of 10
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 10
3. (calibrate satellite2 instrument5 star5)
   added: (calibrated instrument5)
   goals met: 0 of 10
4. (turn_to satellite2 star13 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star13)
   goals met: 0 of 10
5. (take_image satellite2 star13 instrument5 image5)
   added: (have_image star13 image5)
   goals met: 1 of 10
6. (turn_to satellite2 planet8 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 planet8)
   goals met: 1 of 10
7. (take_image satellite2 planet8 instrument5 image5)
   added: (have_image planet8 image5)
   goals met: 2 of 10
8. (turn_to satellite2 phenomenon12 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 phenomenon12)
   goals met: 2 of 10
9. (turn_to satellite1 star4 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star4)
   goals met: 2 of 10
10. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 10
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 10
12. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 2 of 10
13. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 2 of 10
14. (take_image satellite2 phenomenon12 instrument5 image5)
   added: (have_image phenomenon12 image5)
   goals met: 3 of 10
15. (turn_to satellite0 phenomenon10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 10
16. (take_image satellite0 phenomenon10 instrument1 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 4 of 10
17. (turn_to satellite0 star13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star13)
   goals met: 4 of 10
18. (take_image satellite0 star13 instrument1 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 5 of 10
19. (turn_to satellite1 phenomenon10 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 10
20. (take_image satellite1 phenomenon10 instrument3 spectrograph3)
   added: (have_image phenomenon10 spectrograph3)
   goals met: 6 of 10
21. (turn_to satellite1 phenomenon9 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon9)
   goals met: 6 of 10
22. (take_image satellite1 phenomenon9 instrument3 infrared6)
   added: (have_image phenomenon9 infrared6)
   goals met: 7 of 10
23. (turn_to satellite1 planet8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet8)
   goals met: 7 of 10
24. (take_image satellite1 planet8 instrument3 infrared6)
   added: (have_image planet8 infrared6)
   goals met: 8 of 10
25. (turn_to satellite1 star11 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star11)
   goals met: 8 of 10
26. (take_image satellite1 star11 instrument3 infrared6)
   added: (have_image star11 infrared6)
   goals met: 9 of 10
27. (turn_to satellite2 star11 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star11)
   goals met: 10 of 10
